/*
	1. 변수의 데이터형
	   ---- 한 개의 데이터만 저장
	   ---- 메모리 크기 (데이터형 or 자료형 or 기본형)
	   			정수	:	byte(1) / int(4) / long(8)
	   			실수	:	double(8) ==> 소수점 15자리
	   			문자	:	char(2) ==> Unicode => 양수만 (65535)
							-> 모든 문자는 정수로 이루어져 있음 (아스키 코드, ASC)
	   			논리	:	boolean(1) => true / false 만 저장 가능
	   			문자열:
	2. 변수를 만드는 방법
	
	3. 연산자 (데이터 가공)
	
	4. 제어문 (조건, 반복, 선택, 반복제어)
	============================================> 자바 문법의 기본


*/
public class _문제정리 {
	public static void main(String[] args) {
		
	}
}
